# SpikeYOLO SNN YOLOv8 backbone/head configuration (YAML-as-model)
# Adapted for DAGR event input (C=2) and P5 channels alignment (c2=512)

nc: 80  # number of classes (unused in DAGR backbone-only use)
scales:  # [depth, width, max_channels]
  n: [0.33, 0.375, 1024]
  s: [0.33, 0.5, 1024]
  m: [0.5, 0.625, 1024]
  l: [0.5, 0.75, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, MS_GetT_Voxel, [2, 4]]                  # Data -> [T=4,B,2,H,W] via voxelization
  - [-1, 1, MS_DownSampling, [128, 7, 4, 2, True]]
  - [-1, 3, MS_AllConvBlock, [4, 7]]
  - [-1, 1, MS_DownSampling, [256, 3, 2, 1, False]]
  - [-1, 6, MS_AllConvBlock, [4, 7]]          # tap P3
  - [-1, 1, MS_DownSampling, [512, 3, 2, 1, False]]
  - [-1, 9, MS_ConvBlock, [3, 7]]             # tap P4
  - [-1, 1, MS_DownSampling, [1024, 3, 2, 1, False]]
  - [-1, 3, MS_ConvBlock, [2, 7]]
  - [-1, 1, SpikeSPPF, [512, 5]]              # tap P5 (c2 aligned to 512 for DAGR)

# head is intentionally omitted in DAGR; detection head remains in DAGR (CNNHead)

